app/views/home/index.html.erb

SELECT COUNT(*) FROM "adherents"
---
        <h5 class="card-title">Adhérents</h5>
        <p class="card-text">Il y a <strong> <%=Adherent.count%> </strong>adherents actuellement inscrits dans la bibliotheque.</p>

SELECT SUM("ordinateurs"."nbr_copies") FROM "ordinateurs"
---
        <h5 class="card-title">Ordinateurs</h5>
        <p class="card-text">Il y a <strong> <%=Ordinateur.sum(:nbr_copies)%> </strong>ordinateurs disponibles dans la bibliotheque avec <strong> <%=Ordinateur.count%> </strong> marques differentes.</p>

SELECT COUNT(*) FROM "auteurs"
SELECT SUM("documents"."nombre_copies") FROM "documents"
---
        <h5 class="card-title">Documents</h5>
        <p class="card-text">Il y a <strong> <%=Document.sum(:nombre_copies)%> </strong>documents disponibles dans la bibliotheque avec <strong> <%=Document.count%> </strong> titres et <strong><%=Auteur.count%></strong> auteurs differents.</p>

SELECT COUNT(*) FROM "ordinateurs"
SELECT COUNT(*) FROM "emprunt_docs"
SELECT COUNT(*) FROM "empruntordis"
---
        <h5 class="card-title">Emprunts</h5>
        <p class="card-text">Il y a <strong><%= EmpruntDoc.count %></strong> emprunts de documents et <strong><%=Empruntordi.count %></strong> embrunts d'ordinateurs actuellement dans la bibliotheque.</p>

SELECT COUNT(*) FROM "adherents"
SELECT COUNT(*) FROM "auteurs"
SELECT COUNT(*) FROM "documents"
SELECT SUM("ordinateurs"."nbr_copies") FROM "ordinateurs"
SELECT SUM("documents"."nombre_copies") FROM "documents"
SELECT COUNT(*) FROM "emprunt_docs"
SELECT COUNT(*) FROM "empruntordis"
---

<!--Il y a <%Adherent.count%> adherents inscrit dans la bibliotheque <br>
Il y a <%Document.count%> documents disponibles dans la bibliotheque avec <%Auteur.count%> auteurs differents <br>
Il y a <%Ordinateur.sum(:nbr_copies)%> ordinateurs disponibles dans la bibliotheque avec <%Ordinateur.count%> marques differentes <br>
Il y a <strong> <%Document.sum(:nombre_copies)%> </strong>documents disponibles dans la bibliotheque avec <strong> <%=Document.count%> </strong> titres differentes.

<% EmpruntDoc.count %> + <%Empruntordi.count %>-->