app/controllers/adherents_controller.rb

SELECT "adherents".* FROM "adherents"
---
  def index
    @adherents = Adherent.search(params[:search])

INSERT INTO "adherents" ("nom", "prenom", "tel", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nom", "test"], ["prenom", "test12"], ["tel", "11111111111"], ["email", "test@gmail.com"], ["created_at", "2022-05-07 17:58:35.134257"], ["updated_at", "2022-05-07 17:58:35.134257"]]
---
  def create
    @adherent = Adherent.new(adherent_params)

    respond_to do |format|
      if @adherent.save

UPDATE "adherents" SET "nom" = ?, "prenom" = ?, "updated_at" = ? WHERE "adherents"."id" = ?  [["nom", "adherent1"], ["prenom", "adh1"], ["updated_at", "2022-05-13 19:16:04.172898"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @adherent.update(adherent_params)

DELETE FROM "adherents" WHERE "adherents"."id" = ?  [["id", 1]]
---
  def destroy
    @adherent.destroy

SELECT "adherents".* FROM "adherents" WHERE "adherents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_adherent
      @adherent = Adherent.find(params[:id])