app/controllers/auteurs_controller.rb

SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."auteur_id" = ?  [["auteur_id", 1]]
---
  def index
    @auteurs = Auteur.search(params[:search])

INSERT INTO "auteurs" ("nom", "prenom", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nom", "auteur2"], ["prenom", "aut2"], ["created_at", "2022-05-08 00:16:05.732082"], ["updated_at", "2022-05-08 00:16:05.732082"]]
---
  def create
    @auteur = Auteur.new(auteur_params)

    respond_to do |format|
      if @auteur.save

UPDATE "auteurs" SET "nom" = ?, "prenom" = ?, "updated_at" = ? WHERE "auteurs"."id" = ?  [["nom", "Auteur1"], ["prenom", "Aut1"], ["updated_at", "2022-05-13 19:20:27.302626"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @auteur.update(auteur_params)

DELETE FROM "auteurs" WHERE "auteurs"."id" = ?  [["id", 2]]
---
  def destroy
    @auteur.destroy

SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_auteur
      @auteur = Auteur.find(params[:id])