app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE (titre like '%# {params[:search_by_title]}%') AND (id like '%# {params[:search_by_title]}%')
---
  def index
    @documents = Document.search(params[:search])

INSERT INTO "documents" ("titre", "nombre_copies", "created_at", "updated_at", "auteur_id") VALUES (?, ?, ?, ?, ?)  [["titre", "test doc"], ["nombre_copies", 1], ["created_at", "2022-05-07 18:05:38.477091"], ["updated_at", "2022-05-07 18:05:38.477091"], ["auteur_id", 1]]
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save

UPDATE "documents" SET "updated_at" = ?, "auteur_id" = ? WHERE "documents"."id" = ?  [["updated_at", "2022-05-13 19:21:26.592700"], ["auteur_id", 3], ["id", 3]]
---
  def update
    respond_to do |format|
      if @document.update(document_params)

DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]
---
  def destroy
    @document.destroy