app/controllers/empruntordis_controller.rb

  def index
    @empruntordis = Empruntordi.all
---
SELECT "empruntordis".* FROM "empruntordis"

  def create
    if Empruntordi.count(:adherent_id) < 1
      @empruntordi = Empruntordi.new(empruntordi_params)

      respond_to do |format|
        if @empruntordi.save
---
SELECT COUNT("empruntordis"."adherent_id") FROM "empruntordis"
INSERT INTO "empruntordis" ("adherent_id", "created_at", "updated_at", "ordinateur_id") VALUES (?, ?, ?, ?)  [["adherent_id", 1], ["created_at", "2022-05-07 21:15:19.717397"], ["updated_at", "2022-05-07 21:15:19.717397"], ["ordinateur_id", 1]]

  def destroy
    @empruntordi.destroy
---
DELETE FROM "empruntordis" WHERE "empruntordis"."id" = ?  [["id", 7]]

    def set_empruntordi
      @empruntordi = Empruntordi.find(params[:id])
---
SELECT "empruntordis".* FROM "empruntordis" WHERE "empruntordis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]