app/controllers/emprunt_docs_controller.rb

SELECT "emprunt_docs".* FROM "emprunt_docs"
---
  def index
    @emprunt_docs = EmpruntDoc.all

SELECT COUNT("emprunt_docs"."adherent_id") FROM "emprunt_docs"
INSERT INTO "emprunt_docs" ("adherent_id", "document_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["adherent_id", 4], ["document_id", 3], ["created_at", "2022-05-14 18:32:39.119745"], ["updated_at", "2022-05-14 18:32:39.119745"]]
---
  def create
    if EmpruntDoc.count(:adherent_id) <= 5
      @emprunt_doc = EmpruntDoc.new(emprunt_doc_params)

      respond_to do |format|
        if @emprunt_doc.save

UPDATE "emprunt_docs" SET "document_id" = ?, "updated_at" = ? WHERE "emprunt_docs"."id" = ?  [["document_id", 2], ["updated_at", "2022-05-13 19:59:28.770526"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @emprunt_doc.update(emprunt_doc_params)

DELETE FROM "emprunt_docs" WHERE "emprunt_docs"."id" = ?  [["id", 2]]
---
  def destroy
    @emprunt_doc.destroy

SELECT "emprunt_docs".* FROM "emprunt_docs" WHERE "emprunt_docs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_emprunt_doc
      @emprunt_doc = EmpruntDoc.find(params[:id])