app/controllers/ordinateurs_controller.rb

  def index
    @ordinateurs = Ordinateur.search(params[:search])
---
SELECT "ordinateurs".* FROM "ordinateurs"

  def create
    @ordinateur = Ordinateur.new(ordinateur_params)

    respond_to do |format|
      if @ordinateur.save
---
INSERT INTO "ordinateurs" ("marque", "nbr_copies", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["marque", "hp"], ["nbr_copies", 2], ["created_at", "2022-05-07 18:17:14.511856"], ["updated_at", "2022-05-07 18:17:14.511856"]]

  def destroy
    @ordinateur.destroy
---
DELETE FROM "ordinateurs" WHERE "ordinateurs"."id" = ?  [["id", 3]]

    def set_ordinateur
      @ordinateur = Ordinateur.find(params[:id])
---
SELECT "ordinateurs".* FROM "ordinateurs" WHERE "ordinateurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]