app/models/adherent.rb

SELECT "adherents".* FROM "adherents" WHERE "adherents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.search(search)
    if search
      adherent_resultat = Adherent.find_by(id: search)