app/models/auteur.rb

	def self.search(search)
		if search
			auteur_resultat = Auteur.find_by(id: search)
---
SELECT "auteurs".* FROM "auteurs" WHERE "auteurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]