app/models/document.rb

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def self.search(search)
    if search
      document_resultat = Document.find_by(id: search)
        if document_resultat
          self.where(id: document_resultat)