app/models/ordinateur.rb

	def self.search(search)
    if search
      ordinateur_resultat = Ordinateur.find_by(id: search)
---
SELECT "ordinateurs".* FROM "ordinateurs" WHERE "ordinateurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]